# coding=utf8
import logging

logging.basicConfig(level=logging.INFO, format='%(asctime)s %(name)s:%(levelname)s %(message)s')

# 接口地址
API_V1 = 'http://is.snssdk.com/neihan/stream/mix/v1/'
API_V2 = 'http://lf.snssdk.com/neihan/stream/category/data/v2/'

# 爬取休息间隔
CRAWL_PAGE_SLEEP = 10

# 下载器的超时时间，单位秒(s)
DOWNLOAD_TIMEOUT = 5

# 下载器重试次数
RETRY_TIMES = 3

# 数据库配置
MYSQLDB = {
    'host': '39.108.53.90',
    'user': 'root',
    'passwd': 'lupin2008cn',
    'port': 3306,
    'db_name': 'neihanshequ'
}
REDISDB = {
    'host': '127.0.0.1',
    'port': 6379,
    'db': 0
}

CATECODE = {
    "1": "内涵段子",
    "10": "爆笑GIF",
    "136": "梦想与现实",
    "154": "对段子哥有话说",
    "16802": "脑点子通关",
    "171": "异于常人的技能",
    "197": "随手拍生活",
    "2": "搞笑囧图",
    "217": "斗地主",
    "228": "游戏风云",
    "2566": "明星那点事",
    "269": "王者荣耀",
    "273": "段友真会玩儿",
    "280": "段友随手拍",
    "30814": "纯绿色视频",
    "3673": "萌宠集中营",
    "51": "情感点滴",
    "61": "明星圈儿",
    "65": "搞笑视频",
    "76": "友问友答",
    "89": "司机那点事儿",
    "103": "音乐风云",
    "242": "鬼畜视频",
    "243": "舞蹈视频",
    "244": "魔术视频",
    "245": "牛人翻唱",
    "247": "才艺视频",
    "251": "体育视频",
    "252": "科技视频",
    "253": "情感视频",
    "254": "游戏视频",
    "255": "萌宝视频",
    "65": "搞笑视频",
    "15": "脑残对话",
    "228": "游戏风云",
    "36": "二次元御宅族",
    "42": "涨姿势",
    "59": "突然觉得哪里不对",
    "77": "奇葩新闻",
    "80": "来自世界的恶意",
    "81": "奇葩买卖家",
    "85": "日式吐槽",

    "12": "女神来了",
    "109": "美腿控",
    "187": "美胸girl"
}
